print('\nДоброго вечера. Я Альбина')
print('\nЗадание 1: Створити простий калькулятор, який зчитує три рядки введених користувачем даних: перше число, друге число та операцію. '
      '\nПісля цього калькулятор застосовує операцію до введених чисел ("перше число" "операція" "друге число") і виводить результат на екран.',
      '\nПідтримувані операції: +, -, /, *, mod, pow, div, де:',
      '\nmod - це отримання залишку від ділення', '\npow - піднесення до степеня, \ndiv - цілочисельне ділення.')
number1 = int(input("Введите число: "))
number2 = int(input("Введите число: "))
operation = input("Введите операцию (+, -, /, *, mod, pow, div): ")
if operation == '+':
    print('Результат:', number1 + number2)
elif operation == '-':
    print('Результат:', number1 - number2)
elif operation == '/':
    print('Результат:', number1 / number2)
elif operation == '*':
    print('Результат:', number1 * number2)
elif operation == 'mod':
    print('Результат:', number1 % number2)
elif operation == 'pow':
    print('Результат:', number1 ** number2)
elif operation == 'div':
    print('Результат:', number1//number2)
else:
    print('Неизвестная операция')

print('\nЗадание 2: Имеем 2 числа a и b. Определите, делится ли a на b нацело. Делится ли b на a?')
a = int(input("Введите число a: "))
b = int(input("Введите число b: "))
if a % b == 0:
    print(f'{a} делится нацело на {b}')
else:
    print(f'{a} не делится нацело на {b}')
# f - означает форматированную строку (formatted string), которая позволяет подставлять значения переменных внутри строки
# {} - используются для обозначения места, где нужно вставить значение переменной. Внутри фигурных скобок можно использовать выражения, которые будут вычислены и заменены на соответствующее значение.
if b % a == 0:
    print(f'{b} ділиться націло на {a}')
else:
    print(f'{b} не ділиться націло на {a}')

print('\nЗадание 3: Дано трехзначное число. Определите, есть ли среди его цифр одинаковые.')
number = int(input("Введіть трицифрове число: "))
digit1 = number // 100
digit2 = (number // 10) % 10
digit3 = number % 10
if digit1 == digit2 == digit3:
    print("У числі є однакові цифри")
else:
    print("У числі немає однакових цифр")